---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SolidGlass Properties
SolidGlass Class See Also Send Feedback
---

The SolidGlass type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "SolidGlass" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "SolidGlass" schema. |
|  | SolidglassBumpAmount | The property labeled "Amount" from the "SolidGlass" schema. |
|  | SolidglassBumpEnable | The property labeled "Type" from the "SolidGlass" schema. |
|  | SolidglassBumpMap | The property labeled "Image" from the "SolidGlass" schema. |
|  | SolidglassColorByObject | The property labeled "Custom Color" from the "SolidGlass" schema. |
|  | SolidglassGlossiness | The property labeled "Roughness" from the "SolidGlass" schema. |
|  | SolidglassReflectance | The property labeled "Reflectance" from the "SolidGlass" schema. |
|  | SolidglassRefractionIor | The property labeled "Refraction" from the "SolidGlass" schema. |
|  | SolidglassTransmittance | The property labeled "Color" from the "SolidGlass" schema. |
|  | SolidglassTransmittanceCustomColor | The property labeled "Custom Color" from the "SolidGlass" schema. |

# See Also

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace